driver-tests/bpelse/POJOCalls/StruvCvtDateTime_BPELM/src/StruvCvtDateTime.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="StruvCvtDateTime" targetNamespace="http://j2ee.netbeans.org/wsdl/StruvCvtDateTime_BPELM/StruvCvtDateTime"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/StruvCvtDateTime_BPELM/StruvCvtDateTime" xmlns:ns="http://xml.netbeans.org/schema/CvtDateMessages" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/StruvCvtDateTime_BPELM/StruvCvtDateTime">
            <xsd:import namespace="http://xml.netbeans.org/schema/CvtDateMessages" schemaLocation="StruvCvtDateTime/CvtDateMessages.xsd"/>
        </xsd:schema>
    </types>
    <message name="StruvCvtDateTimeOperationRequest">
        <part name="part1" element="ns:elRequest"/>
    </message>
    <message name="StruvCvtDateTimeOperationResponse">
        <part name="part1" element="ns:elResponse"/>
    </message>
    <portType name="StruvCvtDateTimePortType">
        <operation name="StruvCvtDateTimeOperation">
            <input name="input1" message="tns:StruvCvtDateTimeOperationRequest"/>
            <output name="output1" message="tns:StruvCvtDateTimeOperationResponse"/>
        </operation>
    </portType>
    <binding name="StruvCvtDateTimeBinding" type="tns:StruvCvtDateTimePortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="StruvCvtDateTimeOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="StruvCvtDateTimeService">
        <port name="StruvCvtDateTimePort" binding="tns:StruvCvtDateTimeBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/StruvCvtDateTimeService/StruvCvtDateTimePort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="StruvCvtDateTime">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="StruvCvtDateTimePortTypeRole" portType="tns:StruvCvtDateTimePortType"/>
    </plnk:partnerLinkType>
</definitions>
