driver-tests/bpelse/POJOCalls/StruvCvtDateTime_BPELM_CA/test/StruvCvtDateTime/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cvt="http://xml.netbeans.org/schema/CvtDateMessages">
  <soapenv:Body>
    <cvt:elRequest>
      <cvt:elDateString>2008-10-22</cvt:elDateString>
      <cvt:elFormatIn>yyyy-MM-dd</cvt:elFormatIn>
      <cvt:elFormatOut>dd/MM/yyyy</cvt:elFormatOut>
    </cvt:elRequest>
  </soapenv:Body>
</soapenv:Envelope>